<html>
    <title> Logika  project 1 </title>
    <body>
        <header>
                <img src="https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/BeamNG.drive_logo.svg/1920px-BeamNG.drive_logo.svg.png"><h1>Гра BeamNG.drive </h1>
                
        </header>

        <main>
                <p>BeamNG.drive  - комп'ютерна гра в жанрі автосимулятора , яка розробляється та видається компанією BeamNG для платформи Windows . Використовує унікальну фізику м'яких тіл. Є ідейним продовженням попереднього проекту розробників - Rigs of Rods.
                </p>
                <p>BeamNG.drive дозволяє гравцям керувати різними транспортними засобами та знищувати їх на різних картах. Вона відрізняється реалістичною та точною фізикою для керування динамікою транспортних засобів, а також реалістичного моделювання зіткнень між об'єктами та транспортними засобами. Крім того, для гри можуть створюватися користувацькі модифікації . Існує вбудований репозиторій модів, який дозволяє розробникам додавати різні внутрішньоігрові об'єкти. Гравці також можуть встановити будь-які зовнішні модифікації, змінюючи файли гри. Починаючи з версії 0.4.0.0 гра доступна у Steam у ранньому доступі. У грі, на даний момент, немає напряму розробки, однак у версії 0.4.0.0 до неї додані сценарії, в яких гравець повинен пройти через контрольні точки (відрізняється від вільного режиму ) а у версії 0.9.0.5 була додана кампанія під назвою "A Rocky Start" (від англ. - "Скелястий старт"). Також гравці можуть створювати трафік у грі, який теж має фізику зіткнень.</p>
                <p>BeamNG.drive базується на режимі реального часу та структурної фізики м'яких тіл для симуляції поведінки транспортних засобів, які в грі складаються з м'якого корпусу та вузла балочної конструкції, подібно до конструкції транспортного засобу в Rigs of Rods. Фізичний двигун імітує мережу взаємозалежних вузлів та балок, які утворюють невидимий каркас автомобіля з реалістичною вагою та масою. Двигун постійно обчислює фізичні рівняння та завдання у режимі реального часу прямо під час гри.</p>
                <p>Гра в жанрі пісочниця . У грі присутній режим кар'єри, що знаходиться в розробці, в якому гравець повинен заробляти досвід і гроші, виконуючи завдання і проходячи різні гонки. А також різні кампанії на кшталт "Школа Водіння" та "Вухастий старт".
                <p>Наприкінці травня 2012 року BeamNG випустила відео на своєму YouTube- каналі під назвою «Революційна фізика м'яких тіл у „ CryEngine3 “. Спочатку BeamNG.drive використовувала рендерний ігровий двигун CryEngine3, але через велику кількість багів гра була перенесена на двигун Torque 3D. Для розробки BeamNG.drive розробники використовували мову програмування Lua та пакети даних через мережу системи Lua, у той час як гра працює для того, щоб завершити складні рівняння фізики під час гри.

BeamNG створила свій сайт у травні 2012 року, щоб публікувати туди новини про розробку симулятора. На сайті є публічний форум, блог розробників, wiki, стрічка новин, інформація про компанію, корисні посилання.

Гра була розміщена на відкрите голосування в Steam Greenlight 12 лютого 2014. Вже через 9 днів гра отримала зелене світло. Новина про це була опублікована на сайті розробників.

З вересня 2014 року до лютого 2015 року розробники BeamNG.drive додали публічні експериментальні версії гри, в яких були зібрані останні досягнення BeamNG.drive. Steam Early Access Update була офіційно додана до Steam в режим раннього доступу 29 травня 2015.

18 грудня 2015 року на пристроях під керуванням Android та iOS вийшла програма, що дозволяє керувати автомобілем через смартфон.

З версії 0.25 BeamNG.drive підтримує лише 64-бітові операційні системи сімейства Windows.</p>
        <p>BeamNG.drive отримав високі оцінки критиків. У статті BBC Autos автор написав: «До BeamNG виявляють інтерес у кінематографі для моделювання трюків на транспортних засобах, оскільки вони можуть бути ґрунтовно, але дешево — до того, як каскадер розіб'є машину, в якій сидить»</p>
                <img src="">

                <a href="https://ru.wikipedia.org/wiki/BeamNG.drive">
                </a>
<style="background-color:black;fond-family:white;">
</body>
</html>
